<script setup lang="ts">

</script>

<template>
  <main class="bg-gradient flex-1 self-stretch px-5 py-10">
    <h2 class="text-brown-dark font-extrabold text-2xl mb-5">О Mameliya</h2>
    <section class="flex flex-col gap-4">
      <p>
        Mameliya — это уютное онлайн-пространство, созданное с любовью для мам, их семей и тех, кто заботится о себе и близких.
      </p>
      <p>
        Здесь мы бережно собираем вдохновение, идеи и полезные ресурсы, чтобы поддерживать тебя на каждом этапе — от первых шагов в материнстве до баланса между заботой о других и вниманием к себе.
      </p>
      <h3 class="text-brown-dark font-semibold text-lg">Что ты найдёшь на Mameliya:</h3>
      <ul>
        <li>🌼 <span class="font-semibold text-brown-dark">Раздел «Мама»</span> — про поддержку, вдохновение и самоощущение в роли мамы.</li>
        <li>👨‍👩‍👧‍👦 <span class="font-semibold text-brown-dark">Раздел «Семья»</span> — про тёплые отношения, традиции и совместное время.</li>
        <li>👶 <span class="font-semibold text-brown-dark">Раздел «Дети»</span> — идеи для игр, развития и заботы о малышах.</li>
        <li>🧘‍♀️ <span class="font-semibold text-brown-dark">Раздел «Ментальное здоровье»</span> — пространство, где можно выдохнуть и перезарядиться.</li>
        <li>💄 <span class="font-semibold text-brown-dark">Раздел «Ритуалы красоты»</span> — напоминание, что забота о себе — не роскошь, а необходимость.</li>
      </ul>
      <p>
        Мы верим, что в повседневной суете важны даже самые маленькие жесты любви — к себе, к ребёнку, к семье.
      </p>
      <p>
        Mameliya создана, чтобы напоминать: ты не одна. Ты важна. И ты — невероятная.
      </p>
      <p>
        С любовью,
        Команда Mameliya 💛
      </p>
    </section>
  </main>
</template>

<style scoped>
.bg-gradient {
  background: linear-gradient(4deg, rgb(245 218 145) 10%, rgb(241 239 192 / 68%) 70%);
}
</style>
