<script setup lang="ts">

</script>

<template>
  <main class="bg-gradient flex-1 self-stretch px-5 py-10">
    <h2 class="text-brown-dark font-extrabold text-2xl mb-5">О Mameliya</h2>
    <section class="flex flex-col gap-4">
      <p>
        <span class="font-semibold text-brown-dark">Mameliya</span> — это уютное онлайн-пространство, созданное с любовью для мам, их семей и тех, кто хочет заботиться о себе с теплотой и вниманием.
      </p>
      <p>
        Здесь ты найдёшь поддержку, вдохновение и практичные идеи, которые помогут тебе в самых разных ролях — мамы, жены, женщины, просто человека с чувствами, мечтами и своими границами.
      </p>
      <h3 class="text-brown-dark font-semibold text-lg">Что тебя ждёт на Mameliya:</h3>
      <ul>
        <li>🌼 <span class="font-semibold text-brown-dark">Раздел «Мама»</span> — тёплые слова, забота и напоминание о том, как важно быть в ресурсе.</li>
        <li>👨‍👩‍👧‍👦 <span class="font-semibold text-brown-dark">Раздел «Семья»</span> — простые идеи для укрепления связей, совместного досуга и добрых традиций.</li>
        <li>👶 <span class="font-semibold text-brown-dark">Раздел «Дети»</span> — вдохновение для игр, развития и понимания маленького мира.</li>
        <li>🧘‍♀️ <span class="font-semibold text-brown-dark">Раздел «Ментальное здоровье»</span> — инструменты, чтобы восстановиться, услышать себя и выдохнуть.</li>
        <li>💄 <span class="font-semibold text-brown-dark">Раздел «Ритуалы красоты»</span> — напоминание, что твоя забота о себе — важна и заслужена.</li>
      </ul>
      <p>
        У тебя всегда есть с кем поговорить. Наш <span class="font-semibold text-brown-dark">помощник</span> выслушает, поддержит, поможет разобраться в чувствах, если рядом никого нет, или просто хочется поделиться.
      </p>
      <p>
        Веди <span class="font-semibold text-brown-dark">дневник</span>, чтобы хранить свои мысли, воспоминания, мечты и небольшие открытия — всё, что важно именно тебе.
      </p>
      <p>
        Mameliya — это напоминание, что ты не одна.
        Ты важна. Ты заслуживаешь заботы — не только о других, но и о себе.
      </p>
      <p>
        С любовью,
        Команда Mameliya 💛
      </p>
    </section>
  </main>
</template>

<style scoped>
.bg-gradient {
  background: linear-gradient(4deg, rgb(245 218 145) 10%, rgb(241 239 192 / 68%) 70%);
}
</style>
